backend/loadtest.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
  plugins:
    metrics-by-endpoint: {}
    ensure: {}
  ensure:
    p95: 200
    maxErrorRate: 1
scenarios:
  - name: "Health check"
    flow:
      - get:
          url: "/api/health"
  - name: "Anonymous User search (will fail auth but tests rate limit & JWT paths)"
    flow:
      - post:
          url: "/api/notes/search"
          json:
            query: "test sharding"
            limit: 5